app/views/billing_docs/show.html.haml

SELECT "contacts".* FROM "contacts" INNER JOIN "billing_docs_contacts" ON "contacts"."id" = "billing_docs_contacts"."contact_id" WHERE "billing_docs_contacts"."billing_doc_id" = $1  [["billing_doc_id", 3]]
---
      .billing-doc-header
        %p= "To : #{@billing_doc.contacts.map{|i| i.name}.join(' , ')}"

SELECT "line_items".* FROM "line_items" WHERE "line_items"."billing_doc_id" = $1  [["billing_doc_id", 3]]
---
          %th total
        -@billing_doc.line_items.each do |line_item|