app/views/invoices/index.html.haml

    .call-to-action-invoice-estimate
      = link_to 'Create Invoice', new_group_invoice_path(current_user.group.id), class: 'btn-success btn btn-lg'
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]