app/views/invoices/new.html.haml

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
    .form-group
      = form_for @invoice, url: group_invoices_path(current_user.group) do |f|
        .form-group