app/views/contacts/index.html.haml

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
    .add-contact-button
      = link_to "Create Contact", new_group_contact_path(current_user.group.id), title: 'Add Contact', data: {gmodal: true}, class: 'btn btn-success btn-lg'

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" IN (1)
---
          %th{colspan: "2"} name
          %th{colspan: "2"}= link_to " Company", sort_group_contacts_path(current_user.group.id), class: 'company-sort forward', data: {type: 'company', category: 'contacts', group_id: current_user.group.id}