app/views/contacts/show.html.haml

  .col-md-7.col-md-offset-2
    =link_to 'See All Contacts', group_contacts_path(current_user.group.id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]