app/controllers/billing_docs_controller.rb

  def new
    @invoice = BillingDoc.new()
    @invoice.line_items.build
    @invoices_contacts = @invoice.contacts.build
    @contacts = current_user.group.contacts
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 2]]

  def show
    @invoice = BillingDoc.find(params['id'])
---
SELECT "billing_docs".* FROM "billing_docs" WHERE "billing_docs"."id" = $1 LIMIT 1  [["id", "2"]]

  def create
    @invoice  = BillingDoc.new(billing_doc_params)
    params['invoice']["id"].select!{|i| i if i.present?} #take out the empty strings
    params['invoice']["id"].each do |i|
      @invoice.contacts << Contact.find(i)
    end
    @invoice.total = @invoice.line_items.map{|i| i.price * i.quantity}.reduce(:+)
    if @invoice.save
      current_user.group.billing_docs << @invoice
---
INSERT INTO "billing_docs" ("created_at", "due_date", "kind", "note", "state", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", Fri, 25 Oct 2013 18:05:48 UTC +00:00], ["due_date", ""], ["kind", "invoice"], ["note", ""], ["state", "unpaid"], ["title", ""], ["updated_at", Fri, 25 Oct 2013 18:05:48 UTC +00:00]]
INSERT INTO "contacts" ("company_id", "created_at", "email", "job_title", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "contacts".* FROM "contacts" WHERE (name LIKE 'kurt russell' OR name LIKE'Kurt Russell') ORDER BY "contacts"."id" ASC LIMIT 1
SELECT "billing_docs".* FROM "billing_docs"
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT 1
INSERT INTO "line_items" ("billing_doc_id", "created_at", "note", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["billing_doc_id", 2], ["created_at", Fri, 25 Oct 2013 19:30:01 UTC +00:00], ["note", ""], ["updated_at", Fri, 25 Oct 2013 19:30:01 UTC +00:00]]
INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 24 Oct 2013 15:00:32 UTC +00:00], ["name", "Playaz Klub"], ["updated_at", Thu, 24 Oct 2013 15:00:32 UTC +00:00]]
INSERT INTO "users" ("created_at", "email", "encrypted_password", "group_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"