app/controllers/contacts_controller.rb

  def index
    @contacts = current_user.group.contacts.page(params[:page]).per(6)
    @top_contacts = Contact.top_contacts(current_user.group)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]