app/controllers/contacts_controller.rb

  def index
    @contacts = Kaminari.paginate_array(current_user.group.users.includes(:contacts).map{|i| i.contacts}.flatten).page(params[:page]).per(6)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" IN (1)
SELECT "users".* FROM "users" WHERE "users"."group_id" = $1  [["group_id", 1]]

  def new
    @contact = Contact.new
    @group = current_user.group
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]

  def sort
    if request.xhr?
      @contacts = params["ids"].split(',').map{|i| Contact.find(i)}
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "1}"]]

  def company_ajax
    @existing_contact = Contact.find(params["data"]["contact-id"])
    @new_contact = Contact.new
    @group = current_user.group
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]

  def save_company_data
    binding.pry
    @contact = Contact.find(params["contact_id"])
    @contact.company = Company.find(params["contact"]["company_attributes"]["id"])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    if request.xhr?
      contact = Contact.find(params["id"])
      attribute = params[:contact].keys.first
      contact[attribute] = params[:contact].values.first
      contact.save
      render :text => params[:contact].values.first
    else
      binding.pry
     @contact = Contact.find(params[:id])
      company_name = contacts_params[:company_attributes][:name]
      update_params = contacts_params
      update_params.delete(:company_attributes)
      @contact.update_attributes(update_params)
      @contact.company = Company.find_or_create_by_name(company_name)
      @company = @contact.company
      @group = current_user.group
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "contacts" SET "name" = $1, "email" = $2, "job_title" = $3, "address" = $4, "twitter_handle" = $5, "phone_number" = $6, "updated_at" = $7 WHERE "contacts"."id" = 1
INSERT INTO "companies" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 11 Nov 2013 20:34:35 UTC +00:00], ["name", "MMAdurp"], ["updated_at", Mon, 11 Nov 2013 20:34:35 UTC +00:00]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 ORDER BY "companies"."id" ASC LIMIT 1  [["id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]

  def show
    @contact = Contact.find(params[:id])
    @company = @contact.company
    @group = current_user.group
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]

  def create
    binding.pry
    @contact = Contact.new(contacts_params)
      if @contact.save
---
INSERT INTO "contacts" ("address", "company_id", "created_at", "email", "job_title", "name", "phone_number", "twitter_handle", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"