app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE (id IN ())
---
  def sort
    if request.xhr?
      @invoices = Invoice.where("id IN (#{params["ids"]})")

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
  def new
    @invoice = Invoice.new
    @kind = 'invoice'
    @group = current_user.group

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    @invoice = Invoice.find(params[:id])
    @group = current_user.group

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "invoices" SET "title" = $1, "note" = $2, "due_date" = $3, "updated_at" = $4 WHERE "invoices"."id" = 1  [["title", "dsfadsdasds"], ["note", "fdasdds"], ["due_date", "11/13/2013"], ["updated_at", Mon, 11 Nov 2013 19:00:24 UTC +00:00]]
SELECT "contacts".* FROM "contacts" INNER JOIN "invoices_contacts" ON "contacts"."id" = "invoices_contacts"."contact_id" WHERE "invoices_contacts"."invoice_id" = $1  [["invoice_id", 1]]
INSERT INTO "line_items" ("created_at", "invoice_id", "note", "price", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "line_items" SET "invoice_id" = $1, "updated_at" = $2 WHERE "line_items"."id" = 3  [["invoice_id", 1], ["updated_at", Mon, 11 Nov 2013 19:20:26 UTC +00:00]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
  def update
    invoice = Invoice.find(params[:id])
    flash[:notice] = "Successfully updated #{invoice.title.capitalize}"
    invoice.update(invoice_params)
    invoice.contacts.delete_all
    binding.pry
    params["invoice"]["id"].shift #take out the first empty string
    params["invoice"]["id"].each do |i|
      invoice.contacts << Contact.find(i)
    end
    invoice.line_items.delete_all
    invoice_params["line_items_attributes"].values.select{|i| i if !i.empty?}.each do |i|
      invoice.line_items << LineItem.create(i)
    end
    invoice.total = invoice.line_items.map{|i| i.price * i.quantity}.reduce(:+)
    if invoice.save
      binding.pry
      if invoice.kind == "invoice"
        redirect_to(group_invoice_path(current_user.group.id, invoice))

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @invoice = Invoice.find(params['id'])

INSERT INTO "invoices" ("created_at", "due_date", "kind", "note", "state", "title", "total", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "line_items" ("created_at", "invoice_id", "note", "price", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
  def create
    binding.pry
    invoice  = Invoice.new(invoice_params)
    params["invoice"]["id"].shift #take out the first empty string
    params["invoice"]["id"].each do |i|
      invoice.contacts << Contact.find(i)
    end
    invoice.total = invoice.line_items.map{|i| i.price * i.quantity}.reduce(:+)
    invoice.save
    current_user.invoices << invoice
    redirect_to group_invoice_path(current_user.group.id, invoice)

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def paid_invoice
    invoice = Invoice.find(params["data"]["invoice-id"])